#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shuuren/shuuren-alpha/runs/run-Xpc6w9zMxZc4SpjH

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.archive_file.signup: Reading...
data.archive_file.character: Reading...
data.archive_file.signup: Read complete after 0s [id=6c21b48943481d4f6cb249fab0eaaad0281afe57]
data.archive_file.character: Read complete after 0s [id=e53c03ce69673bc085eb3cb7b38e6d9ade13e1af]
aws_iam_role.signup_event_role: Refreshing state... [id=signup_event_role]
aws_api_gateway_rest_api.shuuren_api_gateway_rest_api: Refreshing state... [id=kvf6m5r20e]
aws_acm_certificate.shuuren_cert: Refreshing state... [id=arn:aws:acm:us-east-1:265390238424:certificate/adf4603e-1f50-4653-b239-ade0bcb8362d]
aws_dynamodb_table.character_info: Refreshing state... [id=character_info]
aws_iam_policy.signup_event_policy: Refreshing state... [id=arn:aws:iam::265390238424:policy/signup_event_policy]
aws_api_gateway_rest_api_policy.shuuren_api_policy: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_resource.shuuren_api_user: Refreshing state... [id=pbfffe]
aws_api_gateway_method.shuuren_api_user_get: Refreshing state... [id=agm-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_integration.shuuren_api_user_get_integration: Refreshing state... [id=agi-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_deployment.shuuren_api_deployment: Refreshing state... [id=habru0]
aws_api_gateway_stage.shuuren_api_stage: Refreshing state... [id=ags-kvf6m5r20e-api]
aws_acm_certificate_validation.shuuren_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_iam_role_policy_attachment.signup_event_policy_attachment: Refreshing state... [id=signup_event_role-20221007045500101300000001]
aws_lambda_function.signup_post_confirmation: Refreshing state... [id=signup_post_confirmation]
aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain: Refreshing state... [id=api.shuuren.com]
aws_api_gateway_base_path_mapping.shuuren_api_mapping: Refreshing state... [id=api.shuuren.com/]
aws_cognito_user_pool.shuuren_user_pool: Refreshing state... [id=us-east-1_KFBySRRrW]
aws_cognito_user_pool_domain.shuuren_auth_domain: Refreshing state... [id=auth.shuuren.com]
aws_lambda_permission.allow_cognito_post_confirmation: Refreshing state... [id=AllowExecutionFromCognito]
aws_cognito_user_pool_client.shuuren_client: Refreshing state... [id=5t6dfe58g76h8vkmcfvb2o6keu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_api_gateway_integration.update_character_integration will be created
  + resource "aws_api_gateway_integration" "update_character_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "PUT"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kvf6m5r20e"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.shuuren_api_character_put will be created
  + resource "aws_api_gateway_method" "shuuren_api_character_put" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "PUT"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kvf6m5r20e"
    }

  # aws_api_gateway_resource.shuuren_api_character will be created
  + resource "aws_api_gateway_resource" "shuuren_api_character" {
      + id          = (known after apply)
      + parent_id   = "x7no2x9y44"
      + path        = (known after apply)
      + path_part   = "character"
      + rest_api_id = "kvf6m5r20e"
    }

  # aws_dynamodb_table.character will be created
  + resource "aws_dynamodb_table" "character" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "username"
      + id               = (known after apply)
      + name             = "character"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 5

      + attribute {
          + name = "username"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_dynamodb_table.character_info will be destroyed
  # (because aws_dynamodb_table.character_info is not in configuration)
  - resource "aws_dynamodb_table" "character_info" {
      - arn            = "arn:aws:dynamodb:us-east-1:265390238424:table/character_info" -> null
      - billing_mode   = "PROVISIONED" -> null
      - hash_key       = "username" -> null
      - id             = "character_info" -> null
      - name           = "character_info" -> null
      - read_capacity  = 5 -> null
      - stream_enabled = false -> null
      - tags           = {} -> null
      - tags_all       = {} -> null
      - write_capacity = 5 -> null

      - attribute {
          - name = "username" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # aws_iam_policy.character_api_policy will be created
  + resource "aws_iam_policy" "character_api_policy" {
      + arn         = (known after apply)
      + description = "iam policy for character api lambda"
      + id          = (known after apply)
      + name        = "character_api_policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:BatchGetItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:UpdateItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.character_api_role will be created
  + resource "aws_iam_role" "character_api_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "character_api_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.character_api_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "character_api_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "character_api_role"
    }

  # aws_lambda_function.signup_post_confirmation will be updated in-place
  ~ resource "aws_lambda_function" "signup_post_confirmation" {
        id                             = "signup_post_confirmation"
      ~ last_modified                  = "2022-10-07T04:55:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "pFrkI/dhMwj+u+eoczYeK8V17Lo04IZCTP+IR2fnskE=" -> "cCV8sHNCnoF5iffN0cgteAZo2iFKif6PqonMPsqrznE="
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.update_character will be created
  + resource "aws_lambda_function" "update_character" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "character.zip"
      + function_name                  = "update_character"
      + handler                        = "update_character.update_character_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "mYCZ24xmFJLgvmXMw9xU6Fe4COV8DIx3bYkYyMVWYGo="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.allow_api_gateway will be created
  + resource "aws_lambda_permission" "allow_api_gateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "update_character"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:265390238424:kvf6m5r20e/*/*/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 9 to add, 1 to change, 1 to destroy.


```
</details>
*Pushed by: @rise-sudo, Action: `pull_request`*